<?php
$view = "Програми";
include '../inc/header_client.php'; ?>
<style>
    <?php include '../css/style.css';
    ?>
</style>

<div class="container my-5 py-5">
    <h2 class="py-2">Сви програми</h2>
    <div class="bg-light shadow">
        <ul class="nav nav-pills">
            <li class="nav-item">
                <a class="nav-link active" href="./comb_course.php">Комбиновани курс</a>
            </li>
            <li class="nav-item">
                <a class="nav-link" href="./robotics.php">Роботика</a>
            </li>
            <li class="nav-item">
                <a class="nav-link" href="./game_dev.php">Програмирање игара</a>
            </li>
            <li class="nav-item">
                <a class="nav-link" href="./python.php">Системско програмирање</a>
            </li>
        </ul>

        <div class="py-3 px-5">
            <div class="row my-3">
                <div class="col-md-6">
                    <h5 style="line-height: 1.4;">
                        Комбиновани курс је намењен основцима млађих узраста основне школе.
                        Овај курс интегрише програме <a href="#prog">програмирања</a> и <a href="#robotika">роботике</a> за млађе основце
                        и укључује и наставу и практичне вежбе из области <a href="#info">информатике и рачунарства.</a>
                        Акценат је на програмирању (две трећине наставног фонда часова).
                        Блок часови се реализују тако да је првих 10 - 15 минута првог часа увек
                        резервисано за неку од предвиђених тема из области информатике и рачунaрства.
                    </h5>
                </div>
                <div class="col-md-6">
                    <img src="../css/komb_kurs.jpg" width="100%">
                </div>
            </div>

            <div class="row my-3">
                <div class="col-md-6">
                    <img src="../css/komb_kurs (2).jpg" width="100%">
                </div>
                <div class="col-md-6">
                    <h5 style="line-height: 1.4;">
                        Након тога, у тематском делу часа, обрађују се теме из области програмирања или роботике, а према наставном плану и програму.
                        Млађи основци су подељени у групе према узрасту, а динамика часова је прилагођена управо узрасту групе.
                        Имајући у виду ниво функционалне писмености, часови теоријске наставе, а посебно практичних
                        вежби, реализују се индивидуалним приступом сваком детету понаособ, и са посебном пажњом
                        на спровођењу свих заштитних мера.
                    </h5>
                </div>
            </div>

            <div class="row my-3">
                <div class="col-md-6">
                    <h5 style="line-height: 1.4;">
                        Трајање комбинованог курса није временски ограничено, те свако дете
                        након извесног времена, а по процени свих предавача, може прогресивно прећи у напреднију групу
                        или на следећи (виши) ниво курса.
                        Чести су случајеви да нека деца или целе групе млађих основаца после извесног времена, отпочну
                        неки од курсева предвиђених за старије основце.
                        Током евалуације сви резултати се евидентирају, и кроз сталну комуникацију са родитељима
                        свако дете се усмерава у правцу разавоја знања и вештина одговарајућих личним интересовањима и предиспозиција.
                    </h5>
                </div>
                <div class="col-md-6">
                    <img src="../css/komb_kurs (4).jpg" width="100%">
                </div>
            </div>

            <hr>

            <div class="row">
                <div class="col-md-6">
                    <h2>Scratch</h2>

                </div>
                <div class="col-md-6"></div>
            </div>

            <!-- Informatika -->
            <div id="info"></div>
            <hr>
            <div class="row">
                <h2>Информатика</h2>
                <div class="col-md-6">
                <h5 style="line-height: 1.4;" class="my-5 pt-2">
                    Теоријска и практична настава из информатике и рачунарства усклађена је са
                    когнитивних способностима млађих основаца.
                    У склопу теоријске наставе из информатике и рачунарства, обрађују се различите теме
                    из области хардвера и софтвера различитих рачунарских и мрежних компоненти.
                </h5>
                </div>
                <div class="col-md-6">
                    <img src="../css/info.png" width="100%">
                </div>
            </div>
            <div class="row">
                <div class="col-md-6">
                    <img src="../css/info (17).jpg" width="100%">    
                </div>
                <div class="col-md-6">
                <h5 style="line-height: 1.4;" class="my-4">
                Деца се током презентација наставног материјала често упознају са рачунсарским и другим електронским
                уређајима, које током практичних вежби могу и уживо видети у Робокоду, расклапати, склапати, повезивати ... до нивоа поправке истих.
                Такође, током практичних вежби овладава се вештинама инсталације и покретања различитих програма и софтвера у наменским развојним окружењима.
                Након презентација наставних материјала, врши се провера нивоа стеченог знања из управо или претходно обрађеног градива у форми интуитивних квизова знања.
            </h5>
                </div>
            </div>
            
            <!-- Robotika -->
            <div id="robotika">

            </div>
            <hr>
            <div class="row">
                <h2>Роботика за млађе основце</h2>

            </div>


            <!-- Programiranje -->
            <div id="robotika"> </div>
            <hr>
            <div class="row">
                <h2>Programiranje</h2>

            </div>
            <hr>

        </div>
    </div>
</div>


<?php
include_once("../inc/footer_client.php");
?>